longer-2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       8096;
    }
    outlet
    {
        type            patch;
        nFaces          32;
        startFace       8136;
    }
    bottom
    {
        type            patch;
        nFaces          24;
        startFace       8168;
    }
    top
    {
        type            patch;
        nFaces          120;
        startFace       8192;
    }
    obstacle
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          104;
        startFace       8312;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          8256;
        startFace       8416;
    }
)

// ************************************************************************* //
